In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
df1=pd.DataFrame([[1,2,3,4],[2,3,4,5],[5,6,7,8],[4,2,5,3],[2,6,4,2]],columns=['a','b','c','d'])

In [4]:
df1

   a  b  c  d
0  1  2  3  4
1  2  3  4  5
2  5  6  7  8
3  4  2  5  3
4  2  6  4  2

In [5]:
df1.head(3)

   a  b  c  d
0  1  2  3  4
1  2  3  4  5
2  5  6  7  8

In [6]:
df1.tail(2)

   a  b  c  d
3  4  2  5  3
4  2  6  4  2

In [7]:
df1.shape

(5, 4)

In [8]:
df1.iloc[0,1]

2

In [9]:
df1.iloc[0:2,0:3]

   a  b  c
0  1  2  3
1  2  3  4

In [10]:
df1

   a  b  c  d
0  1  2  3  4
1  2  3  4  5
2  5  6  7  8
3  4  2  5  3
4  2  6  4  2

In [11]:
df1.iloc[1:3,0:2]

   a  b
1  2  3
2  5  6